app/Controllers/Home.php

    public function index(): string
    {
        $profilModel = new ProfilModel();
        $skillsModel = new SkillsModel();
        $pendidikanModel = new PendidikanModel();
        $pekerjaanModel = new PekerjaanModel();
        $projectsModel = new ProjectsModel();
        $messagesModel = new MessagesModel();


        $data = [
            'session' => session(),
            'profil' => $profilModel->first(),
            'skills' => $skillsModel->findAll(),
            'pendidikan' => $pendidikanModel->findAll(),
            'pekerjaan' => $pekerjaanModel->findAll(),
---
SELECT *
FROM `profil`
 LIMIT 1
SELECT *
FROM `skills`
SELECT *
FROM `pendidikan`
SELECT *
FROM `pekerjaan`