app/Controllers/Messages.php

    public function index()
    {
        $data = [
            'page_title' => 'Management Messages',
            'messages'   => $this->messagesModel
                ->orderBy('created_at', 'DESC')
                ->findAll(),
---
SELECT *
FROM `messages`
ORDER BY `created_at` DESC

    public function detail($id)
    {
        $message = $this->messagesModel->find($id);

        if (!$message) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Pesan tidak ditemukan');
        }

        // otomatis menjadi dibaca saat dibuka
        if ($message['status'] == 'baru') {

            $this->messagesModel->update($id, [
                'status' => 'dibaca'
            ]);
---
SELECT *
FROM `messages`
WHERE `messages`.`id` = '1'
UPDATE `messages` SET `status` = 'dibaca', `updated_at` = '2026-07-07 13:46:07'
WHERE `messages`.`id` IN ('1')

    public function markUnread($id)
    {
        $message = $this->messagesModel->find($id);

        if (!$message) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Pesan tidak ditemukan');
        }

        $this->messagesModel->update($id, [
            'status' => 'baru'
        ]);
---
SELECT *
FROM `messages`
WHERE `messages`.`id` = '1'
UPDATE `messages` SET `status` = 'baru', `updated_at` = '2026-07-07 13:45:13'
WHERE `messages`.`id` IN ('1')