app/Controllers/Projects.php

    public function index()
    {
        $data = [
            'page_title' => 'Management Projects',
            'projects'   => $this->projectsModel->findAll(),
---
SELECT *
FROM `projects`

    public function edit($id)
    {
        $project = $this->projectsModel->find($id);
---
SELECT *
FROM `projects`
WHERE `projects`.`id` = '5'