app/Models/ProjectsModel.php

    public function getActive()
    {
        return $this->where('status', 'aktif')->findAll();
---
SELECT *
FROM `projects`
WHERE `status` = 'aktif'